app/controllers/capstones_controller.rb

    def index
      capstones = Capstone.all.order(:id)
---
SELECT "capstones".* FROM "capstones" ORDER BY "capstones"."id" ASC