app/controllers/educations_controller.rb

  def index
    educations = Education.all.order(:id)
---
SELECT "educations".* FROM "educations" ORDER BY "educations"."id" ASC