app/controllers/experiences_controller.rb

  def index
    experiences = Experience.all.order(:id)
---
SELECT "experiences".* FROM "experiences" ORDER BY "experiences"."id" ASC

  def update
    experience = Experience.find_by(id: params[:id])
    experience.job_title = params[:job_title] || experience.job_title
    experience.details = params[:details] || experience.details
    experience.company_name = params[:company_name] || experience.company_name
    experience.start_date = params[:start_date] ||  experience.start_date
    experience.end_date = params[:end_date] || experience.end_date
    if experience.save
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "experiences" SET "start_date" = $1, "end_date" = $2, "job_title" = $3, "company_name" = $4, "details" = $5, "updated_at" = $6 WHERE "experiences"."id" = $7