app/controllers/skills_controller.rb

  def index
    skills = Skill.all.order(:id)
---
SELECT "skills".* FROM "skills" ORDER BY "skills"."id" ASC