app/controllers/students_controller.rb

  def index
    students = Student.all
---
SELECT "students".* FROM "students"

  def create
    student = Student.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
    )
    if student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "phone_number", "short_bio", "linkedin_url", "twitter_handle", "personal_site_url", "online_resume_url", "github_url", "photo_url", "created_at", "updated_at", "password", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"